#include "function.h"
//abcdefghij
int main()
{
    tree root;
    Queue Q;
    Treebuild(root,Q);
    printf("-------------------------------先序遍历结果-------------------------------------\n");
    PreOrder(root);
    printf("\n-------------------------------中序遍历结果-------------------------------------\n");
    InOrder(root);
    printf("\n-------------------------------后序遍历结果-------------------------------------\n");
    PostOrder(root);
    printf("\n-------------------------------层序遍历结果-------------------------------------\n");
    LevelOrder(root);
    return 0;
}